{
  "주제 탐구 독서": {
    "title": "주제 탐구 독서",
    "description": "<주제 탐구 독서>는 중학교 <국어>와 고등학교 <공통국어1>, <공통국어2>의 읽기 영역을 더 깊고 넓게 배우는 과목입니다. 관심 있는 주제에 관해 다양한 책과 자료를 비교·분석·통합하여 읽으며 자신의 관점과 견해를 형성하고, 주제에 대해 깊고 넓게 탐구하는 능력을 기르는 과목입니다.",
    "list": [
      "주제 탐구를 위한 자신의 독서 목적 설정하기",
      "학업과 진로 탐색을 위해 관심 있는 분야에서 탐구할 주제 선정하기",
      "관심 분야의 책과 자료가 지닌 특성 파악하여 읽기",
      "주제와 관련된 책과 자료에서 가치 있는 정보 이해하고 분석하며 읽기",
      "주제에 관련된 책과 자료를 종합하여 읽으며 자신의 관점과 견해 형성하기",
      "매체를 포함한 다양한 방법으로 독서의 과정이나 결과 공유하고 소통하기"
    ],
    "warning": "국어·수학·영어 교과는 졸업 시까지 총 4과목을 초과하여 신청할 수 없습니다."
  },
  "기하": {
    "title": "기하",
    "description": "<기하>는 중학교 <수학>의 ‘도형과 측정’ 영역과 고등학교 <공통수학2>의 ‘도형의 방정식’ 영역과 관련이 있습니다. <기하>는 이차곡선, 공간도형과 공간좌표, 벡터에 대해 이해하고 탐구하는 과목입니다.",
    "list": [
      "포물선, 타원, 쌍곡선의 뜻을 알고 각 이차곡선을 방정식으로 표현하기",
      "이차곡선의 접선의 방정식을 구하기",
      "도형의 위치 관계에 대한 간단한 증명하기",
      "삼수선 정리를 이해하고, 이를 활용하여 문제를 해결하기",
      "좌표공간에서 두 점 사이의 거리와 선분의 내분점의 좌표를 구하기",
      "구를 방정식으로 표현하기",
      "벡터의 뜻을 알고 벡터 연산하기",
      "벡터와 좌표를 대응시켜 표현하기",
      "내적의 뜻을 알고, 두 벡터의 내적 구하기",
      "벡터를 이용하여 직선의 방정식 구하기",
      "좌표공간에서 벡터를 이용하여 평면의 방정식과 구의 방정식 구하기"
    ],
    "warning": "국어·수학·영어 교과는 졸업 시까지 총 4과목을 초과하여 신청할 수 없습니다."
  },
  "세계 문화와 영어": {
    "title": "세계 문화와 영어",
    "description": "<세계 문화와 영어>는 공통 과목에서 기른 영어 역량과 글로벌 문화에 대한 이해를 토대로 다양한 나라의 생활 방식과 문화 현상 등을 영어로 살펴보는 융합 선택 과목입니다. 이를 통해 여러분은 다양한 문화적 배경을 갖는 사람들과 소통하는 능력과 다른 문화를 이해하는 능력을 함께 높일 수 있습니다.",
    "list": [
      "문화 현상 분석하고 다양한 텍스트 유형을 사용하여 설명하기",
      "문화 현상이나 문화적 산물을 비교·대조하여 문화의 보편성과 특수성 파악하기",
      "세계 영어의 의의와 종류, 특징 이해하고 의사소통에 활용하기",
      "타 문화 및 언어에 대한 존중을 바탕으로 문화 정보를 수용하고 의견 표현하기",
      "다양한 장르와 매체에서 검색·수집한 문화 정보를 요약하거나 목적에 맞게 재구성하기",
      "정보 윤리를 준수하여 다양한 목적의 문화 콘텐츠를 제작하고 공유하기",
      "세계 영어에 대한 이해를 바탕으로 적절한 전략과 태도를 갖추어 의사소통에 참여하기",
      "다양한 주제(의식주, 명절과 축제, 종교, 언어, 문학, 음악, 예술, 대중문화, 여행 등)에 대해 영어로 탐구하고 표현하기"
    ],
    "warning": "국어·수학·영어 교과는 졸업 시까지 총 4과목을 초과하여 신청할 수 없습니다."
  },
  "세계시민과 지리": {
    "title": "세계시민과 지리",
    "description": "<세계시민과 지리>는 중학교<사회>와 고등학교 <통합사회1>, <통합사회2>에서 학습한 내용을 기초로 하고, 세계시민, 세계화와 지역 이해, 모자이크 세계, 세계의 다양한 자연환경과 문화, 네트워크 세계, 세계의 인구와 경계 공간, 지속가능한 세계, 세계의 환경 문제와 평화 영역에서 세계 여러 지역의 자연 및 인문환경을 체계적, 종합적으로 이해하고 지속가능한 미래 세계를 위해 바람직한 가치 판단을 하며 적극적으로 행동하는 시민의 자질을 함양하기 위한 과목입니다. 세계의 종교, 축제, 음식 문화에 대한 사례를 다루면서 각 지역의 문화에 대한 존중을 토대로 세계시민으로서의 가치를 내면화할 수 있습니다. 세계의 긍정적 변화와 발전을 모색하는 지구촌 시민으로서 인류의 공동선과 지속가능한 미래를 위해 행동할 수 있는 역량을 기르는 데 도움이 되는 과목입니다.",
    "list": [
      "지리 정보와 지리정보기술이 활용되는 모습을 조사하기",
      "다양한 기후에 따라 인간생활이 다양한 모습으로 살펴보기",
      "지형이 인간생활에 미치는 영향 및 관광자원으로서 지형의 지속가능한 이용 방안 조사하기",
      "세계 주요 종교와 인간생활과의 관계 및 종교 경관의 의미 탐색하기",
      "지리 환경과 세계화의 영향으로 나타나는 다양한 음식과 축제 문화의 다양성 살펴보기",
      "인구 분포 및 구조의 차이에 대한 이해를 통해 인구문제를 탐구하기",
      "국제적 이주의 유형과 국제 이주가 지역에 미치는 영향 탐구하기",
      "식량 자원의 생산과 소비의 특징에 대한 이해를 통해 식량 문제의 원인 탐구하기",
      "글로벌 경제 체제 형성과정을 탐색하고 세계화에 따른 경제 공간 관련 문제들을 이해하기",
      "에너지 자원의 생산과 소비 체계를 이해하고 지속가능한 에너지 생산 방안을 제시하고 평가하기",
      "세계의 주요 환경 문제와 분쟁 상황을 이해하고 인류의 지속가능한 행복 방안을 제시하기"
    ],
    "warning": ""
  },
  "세계사": {
    "title": "세계사",
    "description": "고등학교 <세계사>는 중학교에서 배운 역사를 더 깊고 넓게 배우는 과목입니다. 중학교에서 세계 역사에 대해 배운 내용을 바탕으로 더 넓고 깊게 공부하고 이해하는 데 도움이 되는 과목입니다.",
    "list": [
      "지역 세계의 형성 및 각 지역 세계 특징의 역사적 전개",
      "이슬람 세계의 확대, 몽골 제국의 형성 등 각 지역 세계를 이어주는 교역망의 확대",
      "다양한 모습의 시민 혁명과 산업 혁명을 거쳐 형성된 민주주의와 자본주의 체제의 형성",
      "제국주의의 등장과 국민 국가 건설",
      "제1·2차 세계 대전의 전개와 그 과정에서 등장한 인권과 과학 기술 사용의 문제",
      "냉전과 열전을 거쳐 오늘날까지 이르며 인류가 직면했던 지구적 과제와 그 해결을 위한 노력",
      "역사적 희생과 가치로 형성된 인권·평화·민주주의·생태환경 등의 보전과 노력"
    ],
    "warning": ""
  },
  "정치": {
    "title": "정치",
    "description": "<정치>는 중학교 <사회>에서 배운 민주주의와 시민, 정치과정과 시민 참여에 대해 더 깊고 넓게 배우는 과목입니다. 현대 민주주의 사회에서 공동체 구성원이 갖추어야 할 시민 역량과 일상생활에서의 정치적 생활에 능동적으로 참여하는 민주 시민의 자질을 기르는 데 필요한 진로 선택 과목입니다.",
    "list": [
      "정치 문제와 관련된 사실과 가치를 구분하고, 가치 갈등 문제에 대한 의견의 근거를 수집하고 분석하기",
      "일상생활의 정치적 문제와 사례를 수집·분석하여 해결 방안을 모색하기",
      "민주적 정치과정의 핵심인 선거의 의미를 이해하고, 유권자의 권리와 책임을 인식하며 공동체의 의사 결정 과정에 참여하기",
      "다양한 정부 형태에서 나타나는 견제와 균형의 원리를 보여주는 사례 탐색하기",
      "다수결의 원리, 대화와 타협, 숙의와 토론 등 민주주의 원리 실천하기",
      "유권자로서 미디어를 비판적으로 활용하는 태도 가지기",
      "국가 권력의 독점을 막고 견제와 균형의 원리를 지키려는 국가기관의 활동에 관심을 가지고 존중하는 태도 기르기",
      "국제를 바라보는 다양한 관점과 국제법과 국제기구의 역할을 분석하기",
      "국제 사회에서 발생하는 다양한 갈등을 평화적으로 해결하려는 태도 기르기"
    ],
    "warning": ""
  },
  "윤리와 사상": {
    "title": "윤리와 사상",
    "description": "<윤리와 사상>은 한국 및 동서양의 윤리 사상과 사회사상을 통해 도덕적인 삶과 이상사회에 대한 여러 윤리적 관점을 비교·이해하고, 윤리적 관점에서 자기의 삶과 우리 사회를 성찰해 볼 수 있는 과목입니다.",
    "list": [
      "동양 윤리사상 : 공자, 맹자, 주희, 왕수인 등의 인성론, 윤리적 삶의 목표와 방법론 비교, 자연 그대로의 삶을 강조한 노자와 장자의 사상, 상호의존적인 세계에서 수행과 자비실천, 괴로움의 극복을 강조한 불교 사상",
      "한국 윤리사상 : 다양성의 조화를 강조한 원효, 의천, 지눌의 불교 사상, 도덕 감정의 발현 과정을 탐구한 퇴계와 율곡의 성리학, 앎과 함의 관계를 성찰한 남명, 하곡, 다산의 사상",
      "서양 윤리사상 : 보편윤리와 상대주의, 플라톤과 아리스토텔레스의 윤리사상, 쾌락주의와 금욕주의, 그리스도교 윤리와 자연법 윤리, 칸트의 의무론과 선의지, 결과론과 공리주의, 실존주의, 진화심리학과 신경윤리학, 배려와 책임의 윤리학",
      "사회사상 : 동·서양의 국가관, 국가의 역할과 정당성, 시민적 자유와 사적 삶, 시민적 덕성과 공동선, 민주주의의 지향과, 대의민주주의, 참여와 심의를 통한 민주주의 구현, 자본주의의 원리와 현실, 자본주의의 윤리적 개선과 대안"
    ],
    "warning": ""
  },
  "물리학": {
    "title": "물리학",
    "description": "<물리학>은 초등학교 <과학>부터 고등학교 <통합과학1>, <통합과학2>, <과학탐구실험1>, <과학탐구실험2>에서 다룬 물리학의 기초 개념을 바탕으로 자연 현상을 체계적으로 이해하기 위한 과목으로, 물체의 운동과 에너지를 다루는 힘과 에너지 영역, 전기 에너지의 활용과 정보 통신 기술을 다루는 전기와 자기 영역, 빛과 물질의 기본 특성 및 반도체 소자의 원리를 다루는 빛과 물질 영역으로 구성됩니다.",
    "list": [
      "알짜힘과 돌림힘을 이용한 물체의 평형과 안정성 분석 및 뉴턴 운동 법칙과 운동량 보존 법칙 일상 생활에 적용하기",
      "일-에너지 정리 및 역학적 에너지 보존 법칙 설명하기",
      "열과 역학적 에너지가 서로 전환되는 과정 설명하기",
      "전하를 띤 입자에 의한 전기장과 전위차 설명하기",
      "저항의 연결에 따른 소비 전력 변화 및 축전기와 자성체의 원리 설명하기",
      "전자기 유도 현상이 현대 문명에 미친 영향 인식하기",
      "빛의 굴절과 볼록 렌즈에 의한 상을 이해하고, 빛의 중첩, 간섭을 통한 빛의 파동성과 빛과 물질의 이중성이 다양한 분야에 활용됨을 설명하기",
      "원자 내 전자가 양자화된 에너지 준위를 가지고 있음을 이해하기",
      "고체의 에너지띠 구조로부터 도체, 부도체, 반도체의 차이 이해하기",
      "광속 불변의 원리를 통한 시간 팽창 및 길이 수축 현상 이해하기"
    ],
    "warning": ""
  },
  "생명과학": {
    "title": "생명과학",
    "description": "<생명과학>은 중학교 <과학>, 고등학교 <통합과학1>, <통합과학2>, <과학탐구실험1>, <과학탐구실험2>에서 학습한 내용을 바탕으로 생명 현상에 대한 이해를 다지기 위한 과목입니다. 또 진로 선택 과목인 <세포와 물질대사>, <생물의 유전>과 긴밀하게 연계되고 융합 선택 과목인 <기후변화와 환경생태>, <융합과학 탐구>와도 연계됩니다. 이 과목은 주요 내용이 생명 시스템의 구성, 항상성과 몸의 조절, 생명의 연속성과 다양성의 3개 영역으로 구성되어 있습니다. 이 과목은 생명과학에 대한 흥미와 호기심을 가지고 지식과 실천을 연계하여 미래 사회를 살아가기 위한 역량을 함양하며 올바른 자연관과 생명관을 기를 수 있는 과목입니다.",
    "list": [
      "생명 시스템의 구성 : 세포로부터 생태계까지의 생명 시스템 구성 단계, 물질대사 및 기관계의 통합적 작용에 의한 생명 활동의 유지, 생물과 환경, 생태계를 이루는 군집, 개체군 내 생물들의 상호작용",
      "항상성과 몸의 조절 : 신경 자극의 전도와 전달을 통한 자극에 대한 반응, 신경계와 내분비계에 의한 우리 몸의 항상성 조절 원리, 선천적·후천적 면역 반응에 의한 병원체 방어, 백신 접종에 의한 감염병 예방",
      "생명의 연속성과 다양성 : 염색체의 구조와 DNA, 유전자의 특징, 생식세포 형성과정을 통한 유전적 다양성 전달, 생물이 환경에 적응하여 진화하는 원리, 계통수로 분류 체계에 따른 생물들의 유연관계 표현"
    ],
    "warning": ""
  },
  "물질과 에너지": {
    "title": "물질과 에너지",
    "description": "<물질과 에너지>는 고등학교 <화학>에서 학습한 내용 중 물질 형성과 에너지의 관계에 대한 화학 개념을 더 깊이 배우는 과목입니다. 물질의 상태변화나 화학 변화를 에너지 변화의 관점으로 이해하고 이러한 현상이 일상생활에서 어떻게 적용되어 인간의 삶에 영향을 주는지 배울 수 있으며, 이러한 내용을 응용하여 물질의 변화를 예측할 수 있는 실력을 기르기 위한 과목입니다.",
    "list": [
      "이상 기체와 혼합 기체를 구분하고 기체의 종류를 확인하는 실험 설계하기",
      "액체의 분자 간 상호작용이 끓는점, 증기압에 미치는 영향을 추론하기",
      "고체를 결정과 비결정으로 구분하고, 화학 결합의 종류에 따라 분류하기",
      "다른 액체와 구별되는 물의 성질을 수소 결합을 통해 설명하기",
      "용액의 농도에 따른 증기압, 끓는점, 어는점의 변화 비교하기",
      "화학 변화에서 열이 출입하는 이유를 탐구하고 열화학 반응식으로 표현하기",
      "엔탈피와 엔트로피를 통해 저절로 일어나는 반응 예측하기",
      "반응 속도의 의미와 반응 속도에 영향을 미치는 요인 탐구하기"
    ],
    "warning": ""
  },
  "행성우주과학": {
    "title": "행성우주과학",
    "description": "<행성우주과학>은 일반선택 과목인 <지구과학>에서 학습한 과학 지식과 실천을 연계하여 천체와 우주를 탐구하는 역량을 기르기 위한 과목입니다. 우주탐사와 행성계, 태양과 별의 관측, 은하와 우주 영역에서 태양계, 별, 우주 관련 핵심 개념을 통합적으로 이해함으로써 우주탐사의 중요성을 느끼고, 우주에 존재하는 물질과 에너지의 특징을 탐구하는 과정을 경험할 수 있습니다. 우주를 관측하여 알아낸 팽창 속도 변화, 천체의 거리, 별과 은하의 분광 관측 자료 등 빅데이터를 스프레드시트나 파이썬 등으로 처리하는 과정에서 데이터 사이언스 역량을 기를 수 있습니다.",
    "list": [
      "인공위성을 활용한 우주탐사의 필요성과 우주 위험 감시 기술의 중요성 토론하기",
      "태양의 중력을 통해 태양계의 운동을 설명하고 천체들의 운동 추론하기",
      "태양계 구성 천체들의 특징으로부터 외계 행성의 생명 존재 가능성 추론하기",
      "태양 관측자료를 이용하여 태양의 광구와 대기에서 나타나는 현상 분석하기",
      "별의 관측자료를 활용하여 별의 물리량을 결정하는 방법 평가하기",
      "쌍성과 변광성의 관측자료 분석하여 별의 물리량 결정하기",
      "성단의 특징을 이용하여 은하의 구조와 규모 추론하기",
      "은하를 구성하는 물질의 분포를 해석하여 은하의 물리량 탐구하기",
      "은하의 공간 분포 자료를 수집하여 우주의 구조 해석하기"
    ],
    "warning": ""
  },
  "과학의 역사와 문화": {
    "title": "과학의 역사와 문화",
    "description": "<과학의 역사와 문화>는 중학교 <과학>과 고등학교의 <통합과학1>, <통합과학2>, <과학탐구실험1>, <과학탐구실험2>를 더 깊고 넓게 배우는 과목입니다. 이 과목은 과학의 역사적 사건과 문화적 배경을 중심으로 과학과 사회, 경제, 문화 간의 상호작용을 탐구하며, 과학기술이 인류 및 미래 사회에 미친 영향을 학습합니다. 이를 통해 학생들은 과학적 소양을 함양하고, 문제를 해결할 수 있는 능력을 기르게 됩니다.",
    "list": [
      "인류 문명의 초기부터 현대까지 과학이 발전해 온 과정을 탐구하기",
      "중요한 과학적 발견이 이루어진 역사적, 사회적 맥락과 그 사회적 영향을 이해하기",
      "르네상스와 과학혁명 시기 등을 통해 과학과 예술의 상호작용을 분석하기",
      "과학기술이 사회 발전에 기여한 역할과 그로 인한 사회적 변화 및 문제를 고찰하기",
      "과학 지식의 형성과정에서 과학자의 신념과 가치관이 미친 영향을 사례를 통해 조사하고 발표하기",
      "현대 과학기술이 사회문화에 미친 영향과 그 변화를 분석하기",
      "과학기술의 발달로 인한 미래 사회 변화 예측하기",
      "과학기술과 관련된 사회적 문제 해결에 시민 참여가 중요함을 이해하기",
      "과학적 사고와 탐구 능력을 바탕으로 미래 사회에 필요한 과학적 소양 기르기"
    ],
    "warning": ""
  },
  "스페인어": {
    "title": "스페인어",
    "description": "<스페인어>는 스페인어를 처음 배우는 학습자를 위한 과목입니다. 이 과목을 통해서 일상생활에서 자주 사용되는 스페인어 기본 표현을 익혀서 기초적인 의사소통 능력을 키우고 스페인어권 문화를 이해하여 다른 문화를 이해하고 받아들일 수 있는 세계 시민으로서의 능력을 기를 수 있습니다.",
    "list": [
      "스페인어 발음 규칙에 유의하여 낱말이나 간단한 구 또는 문장을 듣고 의미 이해하기",
      "인사, 소개, 감사, 사과, 축하 등의 표현을 상황에 맞게 표현하기",
      "날씨, 시간, 위치 등의 정보 제공·요구와 관련된 내용을 묘사하거나 설명하기",
      "동의, 의무, 취향, 희망, 감탄, 주문, 수락, 거절, 제안 등에 대한 자신의 생각 말하기",
      "간단한 대화문 읽고 일상생활에서 활용하는 능력 키우기",
      "이메일, 사회 관계망 서비스(SNS), 초대장, 광고문, 포스터, 안내문 등의 핵심어, 주제, 맥락파악하기",
      "의식주, 예절, 관습, 여가, 환경 등 생활 문화와 언어 습관, 지역별 어휘·표현 차이 등의 언어문화를 이해하고 의사소통에 활용하기",
      "축제, 풍속, 놀이 등의 전통 문화와 음악, 미술, 춤 등의 예술 문화를 조사하여 전달하기",
      "지리, 자연, 환경, 역사, 유적, 스포츠, 건축, 인물 등을 매체를 활용하여 전달하기"
    ],
    "warning": ""
  },
  "중국어": {
    "title": "중국어",
    "description": "<중국어>는 기초 중국어를 학습하는 과목입니다. 듣기, 말하기, 읽기, 쓰기 등 기초적인 중국어 의사소통 능력을 기르고, 중국 문화에 대한 내용을 학습하면서 세계시민으로서 공동체 역량과 문화적 감수성도 기를 수 있습니다.",
    "list": [
      "중국어의 표준 발음 익히기",
      "의사소통 기본 표현을 활용하여 상황에 맞게 대화하기",
      "중국어로 된 간단한 텍스트 읽고 주요 의미 파악하기",
      "간단한 정보를 기입하거나, 다양한 유형의 간단한 글 작성하기",
      "중국 문화를 직간접적으로 경험해 보고, 한중 문화 비교하기",
      "디지털 매체를 활용하여 중국어로 자신의 생각과 느낌 표현하기"
    ],
    "warning": ""
  },
  "문학과 영상": {
    "title": "문학과 영상",
    "description": "<문학과 영상>은 중학교 <국어>와 고등학교 <공통국어1>, <공통국어2>의 문학 영역과 매체 영역을 더 깊고 넓게 배우는 과목입니다. 문학 영역과 매체 영역의 내용을 통합하여 창작, 문화 산업, 교육, 연구 등 관련 분야의 진로에 필요한 문화적 역량을 기르는 과목입니다.",
    "list": [
      "문학과 영상의 형상화 방법과 특성 이해하기",
      "창작의 요소와 기법을 바탕으로 문학 작품과 영상물 수용하고 생산하기",
      "양식과 매체에 따른 특성과 효과를 고려하여 문학 작품과 영상물 해석하고 비평하기",
      "문학 작품과 영상물 간의 영향 관계와 상호 작용의 효과 파악하기",
      "소재가 유사한 문학 작품과 영상물을 비교하면서 통합적으로 수용하기",
      "문학 작품과 영상물을 통해 창의적 사고를 표현하고 세계와 소통하기",
      "문학 작품과 영상물을 효과적으로 전달할 수 있는 경로와 매체를 선택하여 공유하기",
      "문학 작품과 영상물을 비판적으로 수용하며 자신의 삶 성찰하기",
      "문학 작품과 영상물의 수용과 생산 활동에 따르는 윤리적 책임 인식하기",
      "문학과 영상에 관련된 진로와 분야에서 요구하는 문화적 소양 탐구하기"
    ],
    "warning": "국어·수학·영어 교과는 졸업 시까지 총 4과목을 초과하여 신청할 수 없습니다."
  },
  "수학과제 탐구": {
    "title": "수학과제 탐구",
    "description": "<수학과제 탐구>는 고등학교 공통 과목인 <공통수학1>, <공통수학2> 이후에 선택할 수 있는 융합 선택 과목으로, 수학과제 탐구의 의미와 다양한 탐구 학습 방법을 익힐 수 있는 과목입니다. 이 과목은 수학의 실용적 측면을 강조하고, 학생의 자기주도적 학습과 탐구 능력을 키우는 데 중점을 둡니다.",
    "list": [
      "수학과제 탐구의 의미와 필요성 이해",
      "연구 윤리의 이해와 준수",
      "문헌 연구, 사례 조사, 수학 실험, 개발 연구 등 다양한 탐구 방법 학습",
      "탐구 주제 선정 및 계획 수립",
      "탐구 수행 및 결과 정리",
      "탐구 결과 발표 및 평가",
      "수학적 모델링을 통한 실생활 문제 해결"
    ],
    "warning": "국어·수학·영어 교과는 졸업 시까지 총 4과목을 초과하여 신청할 수 없습니다."
  },
  "미디어 영어": {
    "title": "미디어 영어",
    "description": "<미디어 영어>는 융합 선택 과목으로, 다양한 미디어를 활용하여 영어로 소통하는 능력과 미디어를 이해하고 활용하는 능력을 동시에 높이는 과목입니다. 학생들은 신문, TV 프로그램부터 최신 온라인 플랫폼까지 다양한 미디어를 영어로 접하고 분석하며, 나아가 직접 콘텐츠를 만들어 보는 경험도 하게 됩니다.",
    "list": [
      "영어 검색 엔진을 활용하여 필요한 정보를 찾아내기",
      "미디어에서 다뤄진 정보의 출처를 확인하고 정보 보안을 준수하기",
      "미디어 내용을 비판적으로 평가하며 미디어 리터러시 역량 기르기",
      "미디어가 전하고자 하는 핵심 내용을 추출하여 요약 및 재구성하기",
      "미디어 정보를 융합하고 적절한 도구를 활용하여 콘텐츠를 제작하기",
      "미디어가 전하는 내용을 비판적 태도로 검색, 선정, 비교 및 분석하기",
      "목적이나 대상에 적합한 미디어를 활용하여 의견이나 정보를 공유하기",
      "미디어에서 접하는 다양한 시청각 단서를 이해하거나 적절하게 표현하기",
      "다양한 주제에 대한 창의적 문제 해결을 위해 미디어를 활용하여 협업하기"
    ],
    "warning": "국어·수학·영어 교과는 졸업 시까지 총 4과목을 초과하여 신청할 수 없습니다."
  },
  "현대사회와 윤리": {
    "title": "현대사회와 윤리",
    "description": "<현대사회와 윤리>는 중학교 <도덕>과 고등학교 <통합사회1>, <통합사회2>를 깊고 넓게 배우는 과목입니다. 이 과목은 현대생활의 다양한 영역에서 발생하는 윤리문제들을 탐구하고 성찰하여 인간과 사회를 윤리적 관점에서 올바로 이해하고 윤리적인 민감성, 판단 능력, 동기를 기르기 위한 과목입니다.",
    "list": [
      "현대 생활과 윤리 : 인간의 삶과 윤리의 관계, 실천윤리학과 다양한 윤리적 쟁점, 동양과 서양의 윤리 이론",
      "생명윤리와 생태윤리 : 출생 및 죽음의 의미와 윤리적 쟁점, 사랑과 성의 관계, 결혼과 가족의 윤리, 자연을 바라보는 동·서양의 관점과 환경 문제에 대한 윤리적 쟁점",
      "과학과 디지털 학습 환경 윤리 : 과학기술의 가치중립성 논쟁, 과학기술의 사회적 책임, 정보 사회와 뉴미디어의 윤리적 쟁점, 인공지능의 윤리적 쟁점",
      "민주시민과 윤리 : 직업 생활의 의미, 직업윤리와 노동에 대한 존중, 시민과 국가의 관계, 시민의 참여와 시민불복종, 분배 정의와 윤리적 쟁점, 교정적 정의와 윤리적 쟁점",
      "문화와 경제생활의 윤리 : 미적 가치와 윤리적 가치, 대중문화의 윤리문제, 의식주·경제생활과 윤리문제, 문화 다양성과 존중",
      "평화와 공존의 윤리 : 사회갈등과 사회통합, 소통과 담론의 윤리, 통일 문제를 둘러싼 쟁점, 평화를 실현하기 위한 윤리적 가치, 국제 분쟁의 해결과 국제 사회에 대한 책임과 기여"
    ],
    "warning": ""
  },
  "도시의 미래 탐구": {
    "title": "도시의 미래 탐구",
    "description": "<도시의 미래 탐구>는 중학교 <사회>와 고등학교 <통합사회1>, <통합사회2>에서 학습한 내용을 기초로 하고 있고 삶의 공간, 도시, 변화하는 도시, 도시 문제와 공간 정의, 도시의 미래 영역에서 학생들이 도시의 특징과 변화 모습을 파악하고 다양성과 차이가 공존하는 도시 공간에 대한 이해를 바탕으로 모두를 위한 도시의 미래를 만들어 가는 과정에 적극적으로 참여하는 시민을 양성하기 위한 과목입니다.",
    "list": [
      "도시의 의미 이해와 도시적 생활양식",
      "도시의 발달 탐구와 다양한 도시의 유형 비교하기",
      "살기 좋은 도시에 대한 다양한 관점을 사례를 통해 이해하기",
      "도시 체계의 이해와 도시 공간 구조의 변화를 사례를 통해 탐구하기",
      "도시의 성장과 변화에 영향을 미치는 도시 브랜딩과 건축을 탐색하기",
      "일상 소비를 사례로 도시 경관과 생활 양식의 변화를 탐구하기",
      "첨단 산업의 발달로 인한 도시 변화와 스마트 도시 개발",
      "도시의 환경 문제와 재난의원인을 이해하고 공간정의의 관점에서 해결방안을 제시하기",
      "도시의 부동산과 주거 문제를 사례를 통해 살펴보고 공간 정의의 관점에서 해결 방안을 제시하기",
      "이주에 따른 도시 인구 구성 및 도시 공간 구조의 변화와 문제점을 탐색하기",
      "지속가능성과 회복력을 높이는 도시 계획과 도시 혁신 탐구하기",
      "도시의 공공성을 높이기 위한 사례를 조사하기"
    ],
    "warning": ""
  },
  "동아시아 역사 기행": {
    "title": "동아시아 역사 기행",
    "description": "고등학교에서 배우는 <동아시아 역사 기행>은 중학교에서 배운 역사와 고등학교 <한국사1>, <한국사2>를 더 깊게 넓게 배우는 과목입니다. 또한 <한국사1>, <한국사2>와 <세계사>를 이어주는 징검다리 역할을 하는 과목이기도 합니다. 그런데 <동아시아 역사 기행>은 시간의 흐름에 따라 공부하기보다는 중요한 내용을 주제별로 묶어 우리나라를 둘러싼 나라와 민족에 대해 학습하는 과목입니다.",
    "list": [
      "역사 기행의 의미와 동아시아의 범위 파악하기",
      "동아시아 각 지역 생태 환경이 만든 유목 세계, 농경 세계, 해양 세계 각각의 생활 모습 비교하기",
      "선사시대부터 시작된 동아시아 지역 간 교류와 유교·불교를 중심으로 한 교류의 양상 파악하기",
      "몽골의 팽창과 임진·병자 전쟁의 영향 및 이슬람과 유럽의 진출로 다양한 된 교류의 모습 탐구하기",
      "제국주의의 침략과 아시아·태평양 전쟁이 동아시아 지역의 생활과 생태 환경에 끼친 영향 탐구하기",
      "침략과 전쟁에 맞선 저항과 연대의 움직임 파악하기",
      "냉전 속의 동아시아 전쟁의 모습과 냉전 전후의 동아시아 각국의 정치·사회적 변화 파악하기",
      "동아시아 각국의 경제 성장 및 그 과정에서의 경제적·교류의 확대, 여러 갈등의 발생을 이해하고 공존과 평화를 위한 해결책 찾기"
    ],
    "warning": ""
  },
  "경제": {
    "title": "경제",
    "description": "<경제>는 중학교 <사회>와 고등학교 <통합사회1>, <통합사회2>를 더 깊고 넓게 배우는 과목입니다. 일반사회 영역의 진로 선택 과목으로 경제학의 기본 원리와 이론 체계를 이해하고, 현실의 경제 문제를 사회현상의 전체적 맥락에서 합리적으로 해결하는 기준과 방법을 학습하며, 경제 환경의 변화에 대응하는 능력을 기르기 위한 과목입니다.",
    "list": [
      "인간의 경제생활을 분석하고 경제 문제의 해결 방법 탐색하기",
      "경제적 쟁점과 문제에 대해 관심을 갖고 숙고하여 문제 해결에 참여하기",
      "편익과 비용을 고려하여 합리적으로 선택하기",
      "수요와 공급을 통해 시장에서 자원 배분이 효율적으로 이루어지는 과정 이해하기",
      "자원 배분의 효율성과 형평성을 고려하여 시장에 개입하는 공공 부문의 역할 이해하기",
      "경제 성장을 위한 정부 정책을 탐구하고 정책에 대해 찬반 논쟁하기",
      "국제 거래를 가능하게 하는 무역원리를 이해하고, 자유무역과 보호 무역정책 비교하기",
      "환율의 결정 원리를 이해하고, 환율의 변동이 경제 생활에 미치는 영향 파악하기"
    ],
    "warning": ""
  },
  "화학": {
    "title": "화학",
    "description": "<화학> 과목은 중학교 <과학>과 고등학교 <통합과학1>, <통합화학2>, <과학탐구실험1>, <과학탐구실험2>, <물질과 에너지>, <화학 반응의 세계>와 긴밀하게 연결됩니다. <화학>은 21세기 사회에서 필수적인 기초 화학 지식을 쌓을 수 있는 과목이며 이 과목을 통해 과학적 소양을 기를 수 있습니다. 우리가 살아가는 세상의 모든 것은 물질로 이루어져 있으며, 물질이 어떠한 성질을 가지고 있는지, 어떤 조건에서 다른 물질로 변하는지 알아보는 것이 바로 <화학>의 핵심입니다. <화학>은 일상생활에서 쉽게 접하는 현상을 설명하고, 자연 세계와 우리 삶을 이해하는 데 있어서 중요한 과목이며 물질의 성질과 변화를 연구하는 과학입니다. 또한 물질의 변화에 초점을 맞추어 다른 물질로 변화가 어떻게 일어나는지, 어떤 원리로 새로운 물질이 만들어지는지 밝혀내는 학문입니다.",
    "list": [
      "화학이 현대 과학·기술·사회의 발전에 기여한 사례를 조사·발표하기",
      "다양한 단위를 몰로 환산하고 물질의 양을 몰 단위로 표현하기",
      "화학 결합의 전기적 성질 설명하기",
      "전기 음성도의 주기적 변화를 이해하고 쌍극자 모멘트를 이용하여 결합의 극성 판단하기",
      "전자쌍 반발이론을 근거로 분자의 구조를 추론하여 모형으로 나타내기",
      "가역 반응에서 나타나는 화학 평형 상태의 특징 설명하기",
      "평형 상수와 반응 지수를 비교하여 반응의 진행 방향 예측하기",
      "물의 자동 이온화와 물의 이온화 상수를 이해하기",
      "몰 농도 용액 만들기",
      "중화 반응에서의 양적관계 설명하고 중화 적정 실험 계획하기"
    ],
    "warning": ""
  },
  "지구과학": {
    "title": "지구과학",
    "description": "<지구과학> 과목은 지구의 특징과 지구에서 일어나는 다양한 자연 현상과 우주에 관해 배웁니다. 지구와 우주의 아름다움을 알고, 지구 시스템의 이해, 지구의 내부와 외부에서 일어나는 현상, 지구의 역사와 시간, 자원과 환경 등 지구과학의 기본 개념을 통합적으로 이해할 수 있는 과학적 사고 역량을 갖추는 것을 목표로 합니다. 이를 통해 올바른 자연관과 우주관을 습득할 수 있을 것입니다. 진로 선택 과목인 <지구시스템과학> 및 <행성우주과학>, 융합 선택 과목인 <기후변화와 환경생태>와 밀접하게 관련됩니다.",
    "list": [
      "해수의 물리적·화학적 성질을 이해하고, 실측 자료로 해수의 특성 해석하기",
      "심층 순환의 발생 원리와 분포를 알고, 표층 순환 및 기후변화 관련성 추론하기",
      "중위도 대기의 특성을 살펴보고, 표층 순환 및 기후변화의 관련성 추론하기",
      "태풍의 특성과 태풍 영향권의 날씨 예측, 주요 악기상의 매커니즘과 대처 방안 제시하기",
      "대기와 해양의 상호작용 사례와 인간 활동에 의한 기후변화 문제 탐색하기",
      "지질시대 구분하기",
      "암석의 순환과 변성작용을 탐구하여 설명하기",
      "우리나라의 대표적 지질공원이 형성된 과정을 이해하고 지속가능한 발전 방안 제안하기",
      "천체의 구분과 식 현상을 통해 행성의 겉보기 운동 설명하기",
      "별의 특성을 이해하고, 별의 물리량 추론하기",
      "별의 진화 과정 해석하기",
      "은하 분류를 통해 우주의 팽창과 진화를 이해하기",
      "우주 팽창을 이해하고, 우주 진화를 현대 우주론 관점에서 비교하기"
    ],
    "warning": ""
  },
  "역학과 에너지": {
    "title": "역학과 에너지",
    "description": "<역학과 에너지>는 초·중학교의 <과학>과 고등학교 <통합과학1>, <통합과학2>, <물리학>에서 배운 역학 관련 개념을 깊이 배우는 과목입니다. 시공간과 운동, 열과 에너지, 탄성파와 소리 영역에서 역학의 기본 법칙을 이해하고, 다양한 물체의 운동 및 열현상과 열기관, 파동의 투과와 반사 및 소리의 간섭과 도플러 현상 등을 다룹니다.",
    "list": [
      "벡터에 대한 이해를 바탕으로 물체의 운동 분석하기",
      "중력을 이용한 인공위성과 행성 운동 분석하기",
      "역학적 에너지 보존과 운동량 보존으로 우주선의 운동 설명하기",
      "일반 상대론의 기본 개념 살펴보기",
      "물질의 상태 변화와 이상 기체의 온도, 압력, 부피의 관계 설명하기",
      "열역학 제1법칙을 이해하고 열기관의 순환 과정 설명하기",
      "엔트로피의 이용한 비가역 현상 설명하기",
      "용수철 진자의 단진동 및 탄성파의 진행, 투과, 반사 이해하기",
      "도플러 효과 및 음파의 간섭 현상 이해하기",
      "악기와 정상파의 관계 이해하기"
    ],
    "warning": ""
  },
  "생물의 유전": {
    "title": "생물의 유전",
    "description": "<생물의 유전>은 중학교 <과학>의 ‘생식과 유전’, 고등학교 <통합과학1>의 ‘시스템과 상호작용’ <생명과학>의 ‘생명의 연속성과 다양성’이 관계됩니다. 이 과목은 유전자의 역할과 유전물질의 구조를 통해 생명 현상을 이해하며, 다양한 유전 현상과 연구 사례를 통해 유전학의 기초를 다질 수 있습니다. 또한, 생명공학 기술을 학습하여 실생활에서 생명과학의 응용성과 유용성을 이해하고, 다양한 생명체의 유전적 특성을 과학적으로 분석하는 능력을 기르는 과목입니다.",
    "list": [
      "유전형질이 유전자를 통해 어떻게 자손에게 전달되는지 이해하기",
      "다유전자 유전 원리와 유전자 이상이 유전병에 미치는 영향 분석하기",
      "원핵세포와 진핵세포의 유전체 구조를 비교하고 공통점과 차이점을 설명하기",
      "DNA의 반보존적 복제 과정을 이해하고 그 의미를 협력적으로 소통하기",
      "전사와 번역을 통해 유전자 발현 과정 이해하기",
      "원핵생물과 진핵생물의 유전자발현 조절 과정 비교하기",
      "생물의 발생 과정에서 세포분화가 유전자발현 조절로 이루어지는 과정 추론하기",
      "생명공학기술 발달 과정의 주요 사건을 조사하고 생활과 산업에 미치는 영향 분석하기"
    ],
    "warning": ""
  },
  "스페인어 회화": {
    "title": "스페인어 회화",
    "description": "<스페인어 회화>는 <스페인어>에서 습득한 어휘, 의사소통 표현, 문화에 대한 지식을 바탕으로 일상생활에서 스페인어로 소통할 수 있도록 듣고 말하는 능력을 기르는 과목입니다. 이 과목을 통해서 습득한 의사소통 능력을 토대로 스페인어 사용자들과 적극적으로 소통하는 주체로 성장할 수 있습니다.",
    "list": [
      "스페인어 발음 규칙에 유의하여 낱말이나 구 또는 문장을 듣고 모방하기",
      "인사, 안부, 소개, 감사, 사과, 환영, 축하, 기원, 전화, 화상 소통 등의 사회적 관계 표현을 상황에 맞게 표현하기",
      "날씨, 시간, 요일, 위치, 인적 사항, 사물, 구매, 이동 등의 정보 제공·요구와 관련된 내용을 묘사하거나 설명하기",
      "사람, 사물, 상황, 경험, 의견, 동의 의무, 확신, 가능성 등 묘사·견해와 관련된 표현을 상황에 맞게 말하기",
      "취향, 선호, 관심, 상태, 감탄, 욕구, 희망, 고충 등 취향·감정에 관한 자신의 생각 말하기",
      "주문, 요구, 명령, 부탁, 계획, 제안, 조건, 수락, 거절, 주의 등에 대한 제안·요청 표현을 말하기"
    ],
    "warning": ""
  },
  "중국어 회화": {
    "title": "중국어 회화",
    "description": "<중국어 회화>는 일반 선택 과목인 <중국어>에 이어서 중국어 의사소통 능력을 기르는 과목입니다. 주로 듣기와 말하기 위주로 학습하기 때문에, 중국어 회화 실력을 높일 수 있습니다. 다양한 매체와 자료를 활용하면서 중국어로 자연스럽게 소통할 수 있는 의사소통 역량과 정보 활용 역량을 기르고, 자신의 진로와 중국과의 연관성을 찾아볼 수 있습니다.",
    "list": [
      "상대방의 말을 듣고 적절하게 반응하기",
      "들은 정보 파악하기",
      "들은 내용을 바탕으로 다양한 매체를 활용하여 자료 검색하기",
      "정확한 발음과 억양으로 말하기",
      "상황과 맥락에 맞게 대화하기",
      "디지털 매체를 활용하여 자신의 생각과 느낌 말하기"
    ],
    "warning": ""
  },
  "언어생활 탐구": {
    "title": "언어생활 탐구",
    "description": "<언어생활 탐구>는 중학교 <국어>와 고등학교 <공통국어1>, <공통국어2>의 문법 영역을 중심으로 듣기·말하기·쓰기, 매체 영역을 더 깊고 넓게 배우는 과목입니다. 다양한 주제를 탐구하며 삶의 맥락에서 언어가 가지는 의미를 인식하고 능동적인 언어 주체로서 바람직한 언어문화를 실천하도록 하는 과목입니다.",
    "list": [
      "자신의 언어생활에서 의미 있는 탐구 주제 발견하기",
      "탐구 절차에 따라 언어 자료 수집하고 비판적으로 분석하기",
      "언어 자료를 평가·해석하고 그 결과 공유하기",
      "다양한 분야 및 교과의 언어 자료에 나타난 표현 특성과 효과 탐구하기",
      "가정, 학교, 사회의 언어 사용에 나타난 정체성과 관계 형성 탐구하기",
      "자신이 속한 사회와 공동체에서 사용하는 언어 탐구하기",
      "광고나 보도 등 매체 환경의 소통에서 사용되는 언어 비판적으로 탐구하기",
      "품격 있는 언어생활의 중요성을 이해하고 공공 언어의 사용 양상 탐구하기",
      "언어가 우리 삶에서 담당하는 역할 이해하기"
    ],
    "warning": "국어·수학·영어 교과는 졸업 시까지 총 4과목을 초과하여 신청할 수 없습니다."
  },
  "미적분Ⅱ": {
    "title": "미적분Ⅱ",
    "description": "<미적분Ⅱ>는 <미적분Ⅰ>에서 배운 다항함수의 미적분 개념을 지수함수, 로그함수, 삼각함수로 확장하여, 좀 더 복잡한 현상을 수학적으로 모델링하고 분석하는 데 필요한 미분과 적분을 다룹니다. 이 과정에서 학생들은 급수, 수열의 극한, 다양한 함수의 미분 및 적분을 학습하며, 이를 통해 더욱 정교한 문제 해결 능력을 기릅니다. 이 과목은 자연과학, 공학, 의학뿐만 아니라, 경영, 경제학 등 사회과학 분야에서도 폭넓게 활용되며, 금융, 통계, 물리 등 실생활에서 접할 수 있는 다양한 문제에 응용될 수 있는 과목입니다.",
    "list": [
      "미적분의 개념, 원리, 법칙, 관계를 탐구하기",
      "곡선의 위로 볼록과 아래로 볼록 등을 판정하기",
      "극한값, 등비급수의 합, 이계도함수, 접선의 방정식, 부정적분, 정적분, 도형의 넓이, 입체도형의 부피 구하기",
      "공학 도구를 이용하여 수열의 극한, 급수, 미분과 적분 탐구하기",
      "미적분 개념을 실생활이나 타 교과와 연결하기",
      "다양한 함수를 미분하기",
      "미분과 적분을 수학의 여러 영역과 연결하기"
    ],
    "warning": "국어·수학·영어 교과는 졸업 시까지 총 4과목을 초과하여 신청할 수 없습니다."
  },
  "사회와 문화": {
    "title": "사회와 문화",
    "description": "<사회와 문화>는 중학교 <사회>에서 배운 사회·문화 단원을 더 깊고 넓게 배우는 과목입니다. 개인이 다양한 관점과 문화를 가진 타인들과 지속적으로 상호작용하며 살아가는 존재이며, 사회 구조의 영향을 받는 존재임과 동시에 사회를 변화시키는 주체라는 사실을 인식하고 민주시민으로서 사회에 참여하는 데 필요한 능력을 기르는 데 필요한 선택 과목입니다. <사회와 문화>는 다양한 사회 현상에 대해 적극적으로 탐구하여 비판적으로 생각하는 능력과 의사 결정을 잘할 수 있는 능력을 기르며, 사회 변동 및 사회 불평등 현상, 문화 다양성에 대하여 살펴볼 수 있습니다. 현대 사회에서 나타나는 다양한 불평등과 차별 현상을 탐구하고 인간다운 생활의 보장과 삶의 질 향상을 위한 복지에 대하여 탐색하는 활동도 합니다. <사회와 문화>를 배우면 다양한 문화와 가치관, 생활양식에 대한 이해와 타인을 존중하는 마음, 포용력을 기르는 데 도움이 됩니다. 또 사회 현상과 문화 관련 이슈를 이해하는 과정에서 비판적 사고력의 향상과 사회 문제에 대한 관심 증진, 사회 활동에 참여하는 능력을 키울 수 있습니다.",
    "list": [
      "사회 현상의 특징, 사회학적 상상력, 사회 현상을 이해하는 관점 비교하기",
      "사회 현상을 다양한 자료 수집 방법을 통해 연구하고, 과학적 절차와 연구 윤리를 준수하기",
      "사회 집단과 사회 조직의 유형 및 변화 이해하기",
      "일탈 행동과 일탈 이론, 사회 통제의 유형 이해하기",
      "사회 변동 요인과 현대 사회의 변동 양상, 사회 운동의 유형과 특징 이해하기",
      "대중문화를 바라보는 관점 비교하기",
      "주류 문화와 하위문화, 이주민 문화에 대한 관점, 다문화 사회와 문화 다양성 분석하기",
      "사회 불평등 현상을 이해하는 관점, 사회 이동과 사회 계층 구조의 유형 및 특징 이해하기",
      "복지 국가의 발전 과정, 사회 복지 제도의 유형과 특징, 현대 사회의 복지 관련 쟁점 다루기"
    ],
    "warning": ""
  },
  "한국지리 탐구": {
    "title": "한국지리 탐구",
    "description": "<한국지리 탐구>는 중학교 <사회>와 고등학교 <통합사회1>, <통합사회2>에서 학습한 내용을 기초로 하여 문제와 쟁점을 사례 중심으로 탐구합니다. 공간정보와 지리탐구, 생활 속 지리탐구, 국토의 변화와 균형 발전 탐구, 환경과 지속가능성 탐구, 동아시아 갈등과 공존 탐구 영역에서 국토환경 및 지역의 지리적 이슈와 쟁점을 깊이 있게 학습하여 주요 문제에 책임감 있게 대처할 수 있는 시민의 자질을 기르기 위한 과목입니다.",
    "list": [
      "탐구 계획에 따라 지리정보기술을 활용하여 데이터를 수집, 분석, 시각화하기",
      "음식의 생산. 유통, 소비 과정 조사를 통해 생산자와 소비자, 상품, 장소이 연결성 제시하기",
      "핫플레이스의 특징과 생성과정을 조사하고 장소마케팅을 활용한 관광 활성화 방안 제시하기",
      "모빌리티 공유서비스의 활용과 일상생활에 미친 영향과 문제점 조사하기",
      "저출생과 고령화, 1인 가구, 다문화 가구 증가의 원인과 배경, 대응 방안 조사하기",
      "우리나라 농업 변화의 특징을 이해하고 지속가능한 농업과 농촌을 위한 정책 제안하기",
      "산업구조의 전환에 대한 이해를 바탕으로 지역의 변화 분석하기",
      "인구 규모 변화 분석을 통해 수도권 집중과 지방소멸을 이해하고 국가균형발전 방안을 평가하기",
      "세계유산으로 등재된 자연경관에 어떤 특징이 있는지 파악하고 등재 가능한 자연경관을 조사하기",
      "환경의 개발과 변화. 보전을 다양한 사례를 활용하여 탐구하기",
      "자연재해의 유형과 특징을 분석하고 재해별 대응 방안을 파악하기",
      "탄소중립과 에너지 정책"
    ],
    "warning": ""
  },
  "역사로 탐구하는 현대 세계": {
    "title": "역사로 탐구하는 현대 세계",
    "description": "중학교에서는 한국사와 세계사를 배웠고, 고등학교의 <한국사1>, <한국사2>에서는 우리나라 역사와 근현대 시기를 중점적으로 배웠습니다. <역사로 탐구하는 현대 세계>는 세계에서 일어나는 여러 가지 현안을 역사적 관점에서 분석해 보는 과목입니다. <통합사회1>, <통합사회2>의 내용 중 일부를 더 깊이 배우고 역사적인 관점으로 다룹니다.",
    "list": [
      "현대 세계를 전후 체제 형성을 중심으로 파악하고, 학습자가 생각하는 현대 세계의 과제를 스스로 정하고 조사하기",
      "제2차 세계 대전 이후 인권·평화를 위해 국제 사회에서 기울인 노력과 그 한계를 파악하고 세계의 전쟁 기념시설에 제시하는 기억 방식을 조사하기",
      "세계 경제의 성장과 기술 혁신의 변화를 조사하고, 생태환경의 문제와 기후 협약 등을 조사하여 그 의미를 이해하기",
      "국제 분쟁과 갈등의 특징을 조사하고 이를 해결하기 위한 역사 정책 사례 탐구하기",
      "경제의 세계화 이후 나타난 변화를 국가, 지역, 세계적 차원에서 파악하기",
      "다문화 사회의 갈등 해결 방법과 문화 다양성의 의미 분석하기"
    ],
    "warning": ""
  },
  "윤리문제 탐구": {
    "title": "윤리문제 탐구",
    "description": "<윤리문제 탐구>는 중학교 <도덕>과 고등학교 <통합사회1>, <통합사회2>를 좀 더 깊고 넓게 배우는 과목입니다. 사회가 변화하면서 경험하게 되는 다양한 문제를 윤리적 관점에서 바라보고 합리적인 해결 방안을 찾는 과정을 연습하여 윤리적 탐구와 성찰 능력을 길러 삶에서 실천할 수 있도록 돕기 위한 과목입니다. 이 과목에서는 시민의 삶에서의 행복과 관련되는 윤리 문제와 인공 지능 시대의 윤리 문제, 생태적 삶에서의 윤리 문제 등을 중심으로 배웁니다.",
    "list": [
      "윤리문제의 의미와 중요성, 윤리문제를 해결하는 데 적용할 수 있는 기준, 윤리문제의 탐구 방법 이해 행복의 의미,",
      "윤리적인 삶과 행복의 관계 탐구",
      "사생활 보호와 공익 추구 사이의 갈등 조정 방안 탐구",
      "사회적 차별을 바라보는 다양한 관점 이해와 사회적 차별을 표현하는 것에 관한 문제점 탐구",
      "지구적 차원의 난민 문제 이해와 해결 방안 탐구",
      "메타버스의 특징에서 비롯되는 윤리문제와 그 해결 방안 탐구",
      "빅데이터와 알고리즘의 편향성 문제 이해, 사회적 책임과 공정성 확보 방안 탐구",
      "인공지능 활용의 윤리적 딜레마와 바람직한 활용 방안 탐구",
      "반려동물과 관련되는 윤리문제, 동물 복지를 둘러싼 논쟁 탐구",
      "기후위기에 대한 인류의 책임, 에너지 전환과 탄소중립을 둘러싼 윤리문제 탐구",
      "진로와 관련되는 윤리문제 선정, 탐구 계획 수립 등"
    ],
    "warning": ""
  },
  "기후변화와 지속가능한 세계": {
    "title": "기후변화와 지속가능한 세계",
    "description": "<기후변화와 지속가능한 세계>는 기후변화를 지구 차원에서 바라보고 정의로운 해법을 찾기 위한 사회과 융합선택 과목입니다. 공존의 시대를 세계시민이자 생태시민으로 살아가는 데 요청되는 기본적인 덕목을 이해하고, 앞으로 여러분이 살아가는 세계에서 지속가능한 변화를 이끌고 기후정의 실현에 참여하는 역량을 기르기 위한 과목입니다.",
    "list": [
      "기후변화를 바라보는 관점",
      "세계 여러 지역에서 나타나는 기후재난",
      "지역, 계층, 시대 등에 따라 차별적으로 받게 되는 기후변화의 영향",
      "기후정의 관점에서 기후변화로 인한 불평등 해소 방안",
      "기후변화에 대응하는 국제 사회의 협력",
      "에너지 전환과 순환 경제",
      "지속가능발전목표(SDGs)와 지역 사례",
      "소비를 비롯한 일상의 지속가능한 생활양식",
      "함께 살아가는 생태시민의 모습"
    ],
    "warning": ""
  },
  "전자기와 양자": {
    "title": "전자기와 양자",
    "description": "<전자기와 양자>는 초·중학교 <과학>과 고등학교 <통합과학1>, <통합과학2>, <물리학>에서 배운 전자기학 및 양자역학 관련 개념을 더 깊이 배우는 과목입니다. 전기와 자기에 대한 이해를 바탕으로 전자기 유도와 반도체 소자 등을 다루는 전자기적 상호작용 영역, 빛의 기본 특성과 관련 기기를 다루는 빛과 정보통신 영역, 빛의 물질의 이중성, 터널 효과 등을 다루는 양자와 미시세계 영역으로 내용이 구성되어 있습니다.",
    "list": [
      "전기장과 자기장의 세기와 방향을 추리하고, 정전기 유도와 유전분극이 활용되는 예시 찾기",
      "전자기 유도를 이해하고, 전자기 유도 활용 기술 설명하기",
      "저항, 축전기, 인덕터, 반도체 소자 활용하는 전자 회로 분석하기",
      "빛의 간섭과 회절 및 광학 기기의 원리, 수차, 편광 원리 이해하기",
      "광전효과와 관련된 기술을 조사하고, 레이저의 특징과 원리 이해하기",
      "이중 슬릿 실험을 통한 입자-파동 이중성 확인하기",
      "양자컴퓨터, 양자암호통신 등의 양자기술 살펴보기",
      "현대의 원자 모형과 보어의 원자 모형 비교하기",
      "핵융합의 원리 이해하고, 별빛 스펙트럼을 통한 별의 구성 요소 추리하기"
    ],
    "warning": ""
  },
  "화학 반응의 세계": {
    "title": "화학 반응의 세계",
    "description": "<화학 반응의 세계>는 고등학교 <화학>에서 학습한 내용 중 화학 반응과 관련된 내용을 더 깊이 배우는 과목입니다. 새롭고 다채로운 물질이 만들어지는 신비한 화학 변화에 대해 이해하고, 이러한 현상이 일상생활에 어떻게 적용되어 인간의 삶에 영향을 주는지 배울 수 있습니다.",
    "list": [
      "산과 염기의 정의를 알고 산과 염기의 성질과 세기를 비교하기",
      "중화 적정 실험을 수행하여 데이터를 얻고 중화 적정 곡선의 특성 탐구하기",
      "염의 가수 분해 실험을 통해 염 수용액의 액성을 예측하기",
      "일반 용액과 완충 용액의 pH 변화를 탐구하고 일상생활에 적용하기",
      "화학 반응에서 산화되는 물질과 환원되는 물질 찾고 산화수 분석하기",
      "화학 전지의 발전 과정을 조사하고 원리 탐구하기",
      "전기 분해의 원리 탐구하고 일상생활에 적용하기",
      "여러 가지 탄소 화합물의 특징을 탐색하고 화학 반응에 활용하기",
      "고분자 물질이 갖는 공통적 특징 추론하기",
      "화학 반응을 통해 합성할 수 있는 새로운 탄소 화합물 제안하기"
    ],
    "warning": ""
  },
  "세포와 물질대사": {
    "title": "세포와 물질대사",
    "description": "<세포와 물질대사>는 생명 현상에 대한 깊이 있는 이해를 할 수 있는 과목입니다. 또한 이 과목은 <기후변화와 환경생태>, <융합과학 탐구>와 연계됩니다. <세포와 물질대사>는 ‘세포’, ‘물질대사와 에너지’, ‘세포호흡과 광합성’의 3개 영역으로 구성되며, 세포와 물질대사에 관련된 분야에 대한 흥미와 호기심을 갖고 학습함으로써 미래 사회에서 살아가는 데 필요한 자연관과 생명관을 배울 수 있습니다. <세포와 물질대사>를 통해 생명 현상을 세포 및 물질대사와 관련지어 보다 과학적이고 창의적으로 해석하는 능력을 기를 수 있을 것입니다. 나아가 과학과 기술 및 사회의 상호 관계를 이해하고 이를 바탕으로 개인과 사회의 문제 해결에 민주 시민으로서 참여하고 실천하는 능력을 기를 수 있습니다.",
    "list": [
      "세포 : 생명체의 구조적·기능적 특성과 기본 구성 물질, 세포 소기관의 유기적 관계와 세포막의 물질 수송, 원핵세포와 진핵세포의 특징과 세포의 연구 방법",
      "물질대사와 에너지 : 물질대사에 의해 일어나는 다양한 생명 활동, 물질대사에 관여하는 효소의 종류와 작용 기작",
      "세포호흡과 광합성 : 미토콘드리아와 엽록체의 구조와 기능, 생명 활동에 필요한 에너지 생산을 위한 세포호흡 과정, 생명 활동에 필요한 에너지 생산을 위한 발효 과정, 빛 에너지를 화학 에너지로 전환하여 유기물을 합성하는 광합성 과정, 세포호흡과 광합성 과정의 관계"
    ],
    "warning": ""
  },
  "지구시스템과학": {
    "title": "지구시스템과학",
    "description": "<지구시스템과학>은 일반 선택 과목인 <지구과학>에서 학습한 과학 지식과 실천을 연계하여 미래 사회를 살아가는 데 필요한 역량을 기르기 위한 과목입니다. 일반 선택의 지구과학 과목에서 학습한 대기와 해양의 상호작용, 지구의 역사와 한반도의 암석 영역의 내용을 지구 탄생과 생동하는 지구, 해수의 운동, 강수 과정과 대기의 운동 영역으로 세분화하였으므로 지구시스템의 상호작용을 구체적으로 탐구할 수 있습니다.",
    "list": [
      "지구 탄생 이후부터 현재까지 지구시스템 각 권역의 형성 과정 추론하기",
      "판을 움직이는 맨틀의 상부 운동과 플룸에 의한 구조 운동을 비교하기",
      "암석의 순환 과정에서 화산활동의 역할과 화산활동으로 생성되는 암석의특성 추론하기",
      "지진파를 이용하여 지구 내부구조를 알아내는 과정 탐구하기",
      "상호작용 측면에서 해류의 형성 과정과 지형류의 발생 원리 탐구하기",
      "해파와 해일이 발생하는 과정을 전 지구적 관점에서 분석하기",
      "실시간 자료 해석을 통해 여러 지역에서의 조석 양상 탐구하기",
      "온실효과 및 태양 자외선 차단 효과, 물의 존재 등으로 지구 생명체 존재 조건 추론하기",
      "열수지 평형과 단열변화를 통해 기상 현상 해석하기",
      "전 지구적 관점에서 바람의 형성 과정 및 대기의 운동 양상 분석하기"
    ],
    "warning": ""
  },
  "기후변화와 환경생태": {
    "title": "기후변화와 환경생태",
    "description": "<기후변화와 환경생태>는 인문계나 이공계로 진학하는 학생 모두에게 적합한 과목으로 기후 위기가 가져오는 생활의 변화에 적극적으로 대응할 수 있는 능력과 협력적 의사소통 능력을 기르기 위한 과목입니다.",
    "list": [
      "기후와 날씨 이해하기",
      "기후와 환경생태의 상호작용 알아보기",
      "기후위기에 따른 해수면 상승과 극한 기상 현상 알아보기",
      "기후변화 시나리오 이해하기",
      "육상생태계, 수생태계의 변화 이해하기",
      "기후변화와 신종 감염병의 출현 알아보기",
      "해양생태계의 변화와 복원",
      "급격한 환경생태 변화와 이에 대응하기 위한 노력 알아보기",
      "탄소 저감 과학기술의 개발과 적용 알아보기",
      "환경생태 보전을 위한 국제 사회의 노력과 시민참여 방안 알아보기"
    ],
    "warning": ""
  },
  "인공지능 기초": {
    "title": "인공지능 기초",
    "description": "<인공지능 기초>는 고등학교 <정보>에서 배운 데이터와 알고리즘, 프로그래밍, 인공지능 영역의 학습을 더 깊고 폭넓게 하기 위한 과목입니다. 현재는 물론, 앞으로 다가올 미래 사회에서 개인의 삶과 다양한 분야에 직접적인 영향을 끼치게 될 인공지능에 대해 깊이 있게 공부하는 과목입니다. 이 과목을 통해 인공지능으로 해결할 수 있는 문제를  찾고 기계학습이나 딥러닝을 통해 문제를 해결하는 방법을 배우며, 다양한 교과와 융합 프로젝터를 수행하면서 윤리적 문제도 배울 수 있습니다. 이러한 내용을 학습하여 인공지능 관련 소양을 기르면 다른 교과 학습에도 큰 도움이 됩니다.",
    "list": [
      "인공지능 기반 문제해결 사례 탐색하기",
      "탐색 알고리즘을 문제해결에 적용하기",
      "추론을 통해 새로운 지식을 생성하는 알고리즘 탐색하기",
      "기계학습을 적용할 문제 정의하고 데이터 탐색하기",
      "적합한 기계학습 알고리즘을 선택하고 프로그래밍을 통해 모델 구현하기",
      "딥러닝을 활용한 문제해결 방법 탐색하기",
      "인공지능으로 해결할 수 있는 사회 문제 탐색하고 직업의 변화 파악하기",
      "인공지능과 인간의 공존 방안 탐색하고 딜레마 문제 토론하기",
      "인공지능 프로젝트의 주제를 탐색하고 수행 계획 세우기",
      "인공지능 소프트웨어 개발하고 평가하기"
    ],
    "warning": ""
  },
  "스페인어권 문화": {
    "title": "스페인어권 문화",
    "description": "<스페인어권 문화>는 스페인어권 문화를 상호문화적 관점에서 이해하여 이를 바탕으로 스페인어 의사소통 능력을 배양하는 과목입니다. 이 과목을 통해 스페인어권의 일상생활 및 사회 문화 전반에 관한 내용을 이해하고 이를 자신의 관심 분야와 연계하여 폭넓은 안목을 갖춘 세계 시민으로 성장할 수 있습니다.",
    "list": [
      "의식주, 예절, 관습, 여가, 환경 등 생활 문화의 내용을 이해하고 의사소통에 활용하기",
      "축제, 풍속, 음식, 놀이 등의 전통문화를 조사하고 분석·정리하고 우리 문화와의 공통점과 차이점 이해하기",
      "음악, 미술, 춤, 문학 등의 예술 문화를 조사하고 분석·정리하고 우리 문화와의 공통점과 차이점 이해하기",
      "언어 습관, 지역별 어휘·표현 차이 등의 언어문화를 이해하고 의사소통에 활용하기",
      "지리, 자연, 환경, 역사, 유적, 스포츠, 건축, 인물 등을 조사하고 이를 관심 분야와 연계하여 내용 정리·심화하기"
    ],
    "warning": ""
  },
  "중국 문화": {
    "title": "중국 문화",
    "description": "<중국 문화>는 상호문화적 관점에서 중국을 이해하고, 다양한 교과와의 연계를 통해 폭넓은 학습을 진행하는 과목입니다. 이를 통해 중국 문화에 대한 이해의 깊이를 더하고, 공동체 의식과 협력적 소통 역량을 키울 수 있습니다. 또한 자신의 삶과 연계된 관심 분야를 조사하고, 그 정보를 활용하면서 미래 사회에 필요한 융합형 인재로서의 역량을 기를 수 있습니다.",
    "list": [
      "다양한 매체를 활용하여 중국 문화 자료 조사하기",
      "중국 문화와 관련된 중국어 표현 활용하기",
      "중국 문화를 직간접적으로 경험해 보기",
      "한중 문화 비교하고 설명하기",
      "주제에 맞게 타 교과와의 연계성 탐색하기",
      "자신의 관심 분야와 중국 문화 연계하기"
    ],
    "warning": ""
  },
  "매체 의사소통": {
    "title": "매체 의사소통",
    "description": "<매체 의사소통>은 중학교 <국어>와 고등학교 <공통국어1>, <공통국어2>의 매체 영역을 더 깊고 넓게 배우는 과목입니다. 매체를 통해 의사소통하는 과정에서 나타나는 현상과 문제점 등을 이전 학년까지의 매체 영역 학습 내용보다 비판적으로 깊이 있게 탐구하고 매체 자료를 직접 제작하는 능력을 향상하는 과목입니다.",
    "list": [
      "시대별 매체의 기능과 역할, 매체 환경과 소통 문화의 변화 이해하기",
      "디지털 매체 환경에서 의사소통 문화의 문제점과 가능성 탐구하기",
      "매체 자료가 현실을 나타내는 방식을 분석하며 생산자의 의도나 관점 파악하기",
      "디지털 매체 환경에서 매체 생산자의 관점을 파악하고 매체 자료의 신뢰성 평가하기",
      "사회적 규범과 규제가 매체 자료와 생산과 소통에 미치는 영향 조사하고 탐구하기",
      "자신의 관점이 드러나는 주제를 선정하여 매체 자료 제작하고 공유하기",
      "매체 자료의 생산자이자 수용자로서의 권리와 책임, 사회적 자치와 문제 인식하기"
    ],
    "warning": "국어·수학·영어 교과는 졸업 시까지 총 4과목을 초과하여 신청할 수 없습니다."
  },
  "전문 수학": {
    "title": "전문 수학",
    "description": "<전문 수학>은 중학교 <수학>과 고등학교 공통 과목인 <공통수학1>, <공통수학2> 이후에 위계에 따라 심화·확장된 내용을 다루는 과목으로 과학 계열 특수 목적 고등학교의 진로 선택 과목입니다. 삼각함수와 미적분, 기하, 확률과 통계의 심화된 내용을 이해하고 탐구하는 과목입니다.",
    "list": [
      "연역적 추론을 통해 삼각함수와 관련된 공식, 기하와 관련된 명제 증명하기",
      "삼각함수의 그래프 그리기",
      "삼각함수와 미적분, 기하, 확률과 통계의 개념, 원리, 법칙, 성질을 설명하기",
      "삼각함수와 미적분, 기하, 확률과 통계의 개념, 원리, 법칙을 활용하기",
      "도형을 방정식과 벡터로 표현하기",
      "적절한 전략을 사용하여 문제 해결하기",
      "삼각함수와 미적분, 기하, 확률과 통계의 개념, 원리, 법칙, 관계를 탐구하기",
      "적절한 공학 도구를 이용하여 수학적 대상 탐구하기",
      "모평균 및 모비율을 추정하기",
      "기하, 확률과 통계의 개념을 실생활과 연결하기"
    ],
    "warning": "국어·수학·영어 교과는 졸업 시까지 총 4과목을 초과하여 신청할 수 없습니다."
  },
  "인문학과 윤리": {
    "title": "인문학과 윤리",
    "description": "<인문학과 윤리>는 중학교 <도덕>과 고등학교 <통합사회1>, <통합사회2>를 더 깊고 폭넓게 배우는 과목입니다. 이 과목에서는 윤리사상과 사회사상에 대한 동서양의 고전 13권을 소개하고 있습니다. 고전에서 발췌한 내용을 직접 읽고 그것이 현재 여러분의 삶에 어떤 의미가 있는가를 탐구하면서 인간의 삶에 대한 여러 가지 근본적 질문에 대한 생각을 깊이 있게 해 볼 수 있습니다.",
    "list": [
      "성찰 대상으로서 나: 『격몽요결』을 통해 몸과 마음의 관계 탐구하기, 『쾌락』을 통해 고통과 쾌락에 지혜롭게 대처하기",
      "타인과 관계 맺기 : 『금강경』을 통해 ‘관계 속의 나’의 의미 성찰하기, 『논어』를 통해 존재와 삶의 관계적 양상 자각하기",
      "자유와 평등 : 『장자』를 통해 자유와 평등의 의미 탐구하기, 『정의론』을 통해 정의로운 사회의 조건 제시하기",
      "다양성과 포용성 : 『자유론』을 통해 다양한 의견 포용하기, 『스노 크래시』를 통해 가상세계에서 자신과 타인 존중하기",
      "공존과 지속가능성 : 『목민심서』를 통해 현대인의 삶의 방식에 대해 생각해 보기, 『침묵의 봄』을 통해 기후위기 문제의 근본 원인 탐구하기",
      "삶의 의미에 대한 물음 : 『신약』, 『꾸란』을 통해 종교에 대한 균형 잡힌 관점 찾기, 『수심결』을 통해 삶의 의미 발견하기"
    ],
    "warning": ""
  },
  "여행지리": {
    "title": "여행지리",
    "description": "<여행지리>는 중학교 <사회>와 고등학교 <통합사회1>, <통합사회2>, <세계시민과 지리>, <도시의 미래 탐구>, <한국지리 탐구>에서 학습한 내용을 활용하여 실생활 맥락에서 접근하는 과목입니다. 행복하고 안전한 여행, 문화와 자연을 찾아가는 여행, 성찰과 공존을 위한 여행, 미래 사회와 여행 영역에서 여행을 하기 위해 필요한 자연 및 인문 경관에 대한 지식과 정보를 탐구하고, 자연과 인간, 지역과 지역, 세계와 지역 간의 관계에 대한 지리적 사고를 확장하는 데 중점을 두는 과목입니다.",
    "list": [
      "여행의 의미 파악과 여행이 삶과 세계 인식에 미치는 영향 살펴보기",
      "모빌리티의 발전에 따른 여행의 다양한 의미를 이해하고 안전한 여행 계획 수립하기",
      "여행지로 알맞은 도시 탐색하기",
      "문화경관 형성의 배경과 의미를 이해하고 정서적 공감과 태도로 여행지 주민 공감하기",
      "여행지의 기후특성을 반영하는 기후환경 이해와 여행지 주민 배려하고 존중하기",
      "지형경관의 가치와 지형 여행지의 선정기준 수립",
      "산업유산과 기념물을 조사하고 여행지의 가치 평가하기",
      "평화여행을 통해 더 나은 미래 성찰하기",
      "창조, 첨단기술 등에 기반한 세계의 다양한 지역과 여행 콘텐츠 조사하기",
      "공정여행의 필요성을 탐색하고 공존의 의미와 생태 감수성 성찰하기",
      "미디어와 여행의 관계를 통해 미래 여행의 모습 탐색하기",
      "일상 속 다양한 여행을 조사하고 여행을 통한 진로 탐색하기"
    ],
    "warning": ""
  },
  "금융과 경제생활": {
    "title": "금융과 경제생활",
    "description": "<금융과 경제생활>은 중학교 <사회>와 고등학교 <통합사회1>, <통합사회2>, <경제>를 융합·응용한 과목입니다. 일반사회 영역의 융합 선택 과목으로 금융 생활과 관련된 금융 지식, 금융 의사 결정 능력, 건전한 재무적 태도와 습관을 길러 경제적으로 건전한 시민이 되어 행복하게 살아갈 수 있는 능력을 기르기 위한 과목입니다.",
    "list": [
      "행복하고 안전한 금융 생활에 필요한 금융 정보를 탐색하고 평가하기",
      "금융 의사 결정에 필요한 자료를 수집해서 합리적으로 금융 의사 결정하기",
      "디지털 금융 환경에서 변화된 금융 서비스의 이용 방법과 주의사항 인식하고 활용하기",
      "수입과 소득에 영향을 미치는 다양한 요인을 탐구하고, 각 요인이 미치는 영향 파악하기",
      "지출의 유형을 구분하고, 자신에게 적합한 지불수단과 방법을 활용하여 합리적으로 소비하기",
      "생애 주기별 예산 관리 계획을 수립하고, 우선순위·현실성 등을 고려하여 점검·평가하기",
      "저축과 투자에 영향을 미치는 요인을 이해하고, 금융 투자 상품의 종류와 특징을 고려하여 투자 의사결정하기",
      "책임감 있고 분별력 있게 신용과 위험 관리하기",
      "금융 의사 결정이 사회에 미치는 영향력을 고려하여 책임감 있는 금융 의사 결정하기"
    ],
    "warning": ""
  },
  "융합과학 탐구": {
    "title": "융합과학 탐구",
    "description": "<융합과학 탐구>는 중학교 <과학>과 고등학교 <통합과학1>, <통합과학2>, <과학탐구실험1>, <과학탐구실험2>를 더 깊고 넓게 배우는 과목입니다. 빅데이터, 인공지능, 모의실험 등 디지털 도구를 활용한 융합적 탐구 활동을 통해 과학적 문제 해결 능력과 창의적 사고를 기르고, 다양한 사회 문제를 창의적으로 융합적으로 해결하는 역량을 키우는 것을 목표로 합니다.",
    "list": [
      "다양한 과학 분야와 기술을 결합하여 문제 해결하기",
      "데이터의 종류와 가치를 이해하고 활용하기",
      "디지털 탐구 도구를 사용하여 데이터를 수집하고 분석하기",
      "융합적 탐구 문제를 발견하고 가설을 세우기",
      "데이터 시각화를 통해 정보를 효과적으로 전달하기",
      "인공지능과 같은 최신 기술을 탐구 활동에 활용하기",
      "과학적 탐구 과정을 통해 얻은 결과를 평가하고 결론 도출하기",
      "미래 사회의 융합과학기술 예측하고 대비하기",
      "사회적 문제 해결에 있어서 융합과학의 역할 이해하기",
      "융합과학 탐구에서 윤리적 고려와 시민 참여의 중요성 알기"
    ],
    "warning": ""
  },
  "소프트웨어와 생활": {
    "title": "소프트웨어와 생활",
    "description": "<소프트웨어와 생활>은 고등학교 <정보>에서 학습한 컴퓨팅 시스템, 데이터, 알고리즘과 프로그래밍, 인공지능의 내용을 바탕으로 융합 프로젝트를 수행하는 과목입니다. 따라서 <정보>에서 배운 지식과 기능, 태도를 다양한 분야의 문제해결 과정에 융합적으로 적용하는 방법을 학습합니다. 이 과목을 통해 소프트웨어에 대한 기본 개념과 원리를 실생활과 다양한 학문 분야에서의 문제해결에 융합적으로 적용하는 과정을 경험할 수 있습니다.",
    "list": [
      "소프트웨어와 사회 변화의 관계 파악하기",
      "소프트웨어 융합을 통해 해결할 수 있는 문제 탐색하기",
      "문제 해결에 적합한 피지컬 컴퓨팅 센서와 액추에이터 탐색하기",
      "피지컬 컴퓨팅을 통해 창작품 구현하기",
      "다양한 분야의 데이터 탐색하기",
      "데이터 처리 및 분석한 후 의미 파악하기",
      "다양한 시뮬레이션 프로그램 활용하기",
      "시뮬레이션 소프트웨어를 통해 현실 세계 모델링하기",
      "소프트웨어 스타트업 사례 탐색하기",
      "소프트웨어 스타트업 프로젝트 수행하기"
    ],
    "warning": ""
  },
  "심화 스페인어": {
    "title": "심화 스페인어",
    "description": "<심화 스페인어>는 일반 선택 과목인 <스페인어>에서 습득한 기초적인 스페인어 의사소통 능력을 확장·심화하는 과목입니다. 이 과목을 통해서 스페인어 의사소통 능력을 심화하고 스페인어권 세계를 이해하여 전 세계 스페인어 사용자들과 소통하고 교류하는 데 필요한 능력을 키울 수 있습니다.",
    "list": [
      "스페인어 발음 규칙에 유의하여 낱말이나 구 또는 문장을 듣고 의미 이해하기",
      "인사, 소개, 감사, 사과, 축하 등의 사회적 관계 표현을 상황에 맞게 표현하기",
      "날씨, 시간, 위치, 구매 등의 정보 제공·요구와 관련된 내용을 묘사하거나 설명하기",
      "동의, 의무, 취향, 희망, 감탄, 주문, 수락, 거절, 제안 등에 대한 자신의 생각 말하기",
      "간단한 대화문 읽고 일상생활에서 활용하는 능력 키우기",
      "이메일, 사회 관계망 서비스(SNS), 초대장, 광고문, 포스터, 안내문 등의 핵심어, 주제, 맥락파악하고 다양한 유형의 글을 작성하기",
      "의식주, 예절, 관습, 여가, 환경 등 생활 문화와 언어 습관, 지역별 어휘·표현 차이 등의 언어문화를 이해하고 의사소통에 활용하기",
      "축제, 풍속 등의 전통 문화와 음악, 미술 등의 예술 문화를 조사하고 분석·정리하기",
      "지리, 자연, 환경, 역사, 유적, 스포츠, 건축, 인물 등을 매체를 활용하여 전달하기"
    ],
    "warning": ""
  },
  "심화 중국어": {
    "title": "심화 중국어",
    "description": "<심화 중국어>는 일반 선택 과목인 <중국어>보다 한 단계 높은 수준의 중국어를 학습하는 과목입니다. 듣기, 말하기, 읽기, 쓰기, 문화 영역에서 중국어를 심화 학습하면서 중국어 의사소통 능력을 더욱 향상시키고, 중국에 대한 이해의 폭을 넓혀서 본인의 진로와도 연계시킬 수 있습니다.",
    "list": [
      "발음과 억양에 유의하여 정확하게 발음하고 낭독하기",
      "상황에 맞게 상대방과 교류하기",
      "다양한 형식의 매체로 표현된 자료 비판적으로 읽고 공유하기",
      "상황에 맞게 정보를 기입하거나 다양한 유형의 글 작성하기",
      "다양한 중국 문화를 직간접적으로 경험해 보고, 한중 문화 비교하여 설명하기",
      "중국 문화에 대한 이해를 바탕으로 진로와의 연계성 모색하기"
    ],
    "warning": ""
  },
  "인공지능 수학": {
    "title": "인공지능 수학",
    "description": "<인공지능수학>은 고등학교 공통 과목인 <공통수학1>, <공통수학2> 또는 <기본수학1>, <기본수학2> 이후에 선택할 수 있는 융합 선택 과목으로, 인공지능 기술에 활용되는 수학적 개념과 원리를 학습하고, 실제 인공지능 시스템에서 수학이 어떻게 적용되는지 탐구할 수 있는 과목입니다.",
    "list": [
      "인공지능의 개념과 역사, 빅데이터와 인공지능의 관계",
      "텍스트 데이터의 표현과 분석 (집합, 벡터 활용)",
      "이미지 데이터의 표현과 분석 (행렬 활용)",
      "데이터의 경향성 파악과 예측",
      "최적화 기법 (손실함수, 경사하강법)",
      "인공지능의 의사 결정 과정에서의 수학적 원리",
      "인공지능과 관련된 수학 주제 탐구"
    ],
    "warning": ""
  },
  "법과 사회": {
    "title": "법과 사회",
    "description": "<법과 사회>는 중학교 <사회>에서 배운 법의 의미, 생활과 관련된 다양한 법(률), 인권과 기본권 등 기초지식을 좀 더 깊이 배우는 과목입니다. <법과 사회>는 법의 역할이 무엇이고 법이 사회 현상에 미치는 영향을 탐구합니다. 이를 통해 사회 구성원들의 행동과 관계를 규율하고 사회 발전에 미치는 영향을 살펴보기도 합니다.",
    "list": [
      "개인 간 사적 자치에 의해 법(률) 관계를 형성하고 분쟁을 해결하기",
      "국가기관의 조직과 운영 원리 분석하기",
      "학교생활에서 발생하는 다양한 법적 문제를 발견하고 분석하기",
      "건전한 시민 의식과 법적 사고력을 기르고 문제를 해결하기 위해 능동적으로 참여하기",
      "법, 조약, 판례, 입법자료 등을 탐색하는 정보 활용 능력을 길러 사회문제 해결하기",
      "법적 쟁점에 대해 법적 근거를 바탕으로 다양한 관점에서 의사소통하기",
      "민주주의와 법치주의의 기본 가치 내면화하기",
      "민주시민으로서 공동체의 발전에 능동적으로 참여하기",
      "법 개선 과정에의 참여를 통한 민주시민의 자질 갖추기"
    ],
    "warning": ""
  },
  "국제 관계의 이해": {
    "title": "국제 관계의 이해",
    "description": "<국제 관계의 이해>는 중학교 <사회> 고등학교 <통합사회1>, <통합사회2> 에서 학습한 국제 사회 관련 단원을 더 깊고 폭 넓게 배우는 진로 선택 과목입니다. 또한 외국어·국제·계열의 진로 선택 과목들과도 연관성이 있습니다. 이 과목의 학습을  통해 세계시민으로서 갖추어야 하는 태도를 기를 수있으며 안보, 평화, 보건, 경제 등과 관련하여 많은 국가에서 주목하고있는 이슈에 대한 합리적 의사결정 능력을 기를 수 있습니다.",
    "list": [
      "국제 관계의 변천 과정과 국제 사회를 바라보는 관점 분석하기",
      "국제 사회의 행위 주체 파악하기",
      "국가 간 불평등과 공정 무역 설명하기",
      "공적 개발 원조 이해하기",
      "우리나라의 위상과 역할 파악하기",
      "전쟁과 테러, 펜데믹과 보건에 대해 이해하기",
      "감시와 통제, 한반도의 평화에 대해 학습하기",
      "외교와 국제법을 통해 국제 분쟁 해결 방안 찾기",
      "지역 통합, 지역 기구에 대해 학습하기",
      "우리나라가 가입한 조약과 지역 기구 파악하기"
    ],
    "warning": ""
  },
  "사회문제 탐구": {
    "title": "사회문제 탐구",
    "description": "<사회문제 탐구>는 중학교 <사회>와 고등학교 사회과 일반 선택 과목에서 학습한 기본 지식을 바탕으로 사회에서 발생하는 다양한 문제를 연구하고 분석하는 과정을 의미합니다. 특정 사회적 현상이나 이슈에 대해 깊이 있는 이해를 추구하며, 문제의 원인, 영향, 해결 방안 등을 탐색하는 것을 포함한 일반사회 영역의 융합 선택 과목입니다.",
    "list": [
      "사회과학적 접근 방법을 통해 사회 현상의 원리를 이해하고 그 해결 방안을 탐구하기",
      "과학적 탐구 절차에 따른 자료를 수집하고 분석하여 해결 방안 모색하기",
      "다양한 출처에서 찾은 자료와 정보의 타당성과 신뢰성 평가하기",
      "사회문제의 해결을 위한 합리적이고 창의적인 대안 제시하기",
      "자신 및 상대방의 의견을 비판적으로 검토하고, 다양한 관점을 고려하여 의사소통하기",
      "민주적 절차와 방법을 활용하여 사회문제의 해결 방안 도출하기",
      "사회적 소수자에 대한 공감과 배려를 위한 가치 인식하기",
      "사회 구성원으로서 자신의 권리와 의무를 인식하고 실천하기"
    ],
    "warning": ""
  }
}